tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
# Library for command-line editing
brew "readline"
# Python code formatter
brew "black"
# Portable Foreign Function Interface library
brew "libffi"
# Interpreted, interactive, object-oriented programming language
brew "python@3.9"
# Core application library for C
brew "glib"
# Manage compile and link flags for libraries
brew "pkg-config"
# Reimplementation of ctags(1)
brew "ctags"
# Command-line fuzzy finder written in Go
brew "fzf"
# Geospatial Data Abstraction Library
brew "gdal"
# GitHub command-line tool
brew "gh"
# Generate introspection data for GObject libraries
brew "gobject-introspection"
# OpenType text shaping engine
brew "harfbuzz"
# Open source relational database management system
brew "mysql"
# Platform built on V8 to build network applications
brew "node"
# Cryptography and SSL/TLS Toolkit
brew "openssl@3"
# Friendly PIL fork (Python Imaging Library)
brew "pillow"
# Object-relational database system
brew "postgresql"
# Framework for managing multi-language pre-commit hooks
brew "pre-commit"
# Python version management
brew "pyenv"
# Pyenv plugin to manage virtualenv
brew "pyenv-virtualenv"
# It's not just a linter that annoys you!
brew "pylint"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Static analysis and lint tool, for (ba)sh scripts
brew "shellcheck"
# Pythonic workflow system
brew "snakemake"
# Simplified and community-driven man pages
brew "tldr"
# Terminal multiplexer
brew "tmux"
# Vi 'workalike' with many additional features
brew "vim"
# Fast CSV toolkit written in Rust
brew "xsv"
# Download YouTube videos from the command-line
brew "youtube-dl"
# General-purpose lossless data-compression library
brew "zlib"
