tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
# Library for command-line editing
brew "readline"
# Command-line interface for SQLite
brew "sqlite"
# General-purpose data compression with high compression ratio
brew "xz"
# Interpreted, interactive, object-oriented programming language
brew "python@3.10"
# Python code formatter
brew "black"
# Embeddable SQL OLAP Database Management System
brew "duckdb"
# GitHub command-line tool
brew "gh"
# Cryptography and SSL/TLS Toolkit
brew "openssl@3"
# Framework for managing multi-language pre-commit hooks
brew "pre-commit"
# Python version management
brew "pyenv"
# Pyenv plugin to manage virtualenv
brew "pyenv-virtualenv"
# It's not just a linter that annoys you!
brew "pylint"
# Interpreted, interactive, object-oriented programming language
brew "python@3.9"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Static analysis and lint tool, for (ba)sh scripts
brew "shellcheck"
# Tool Command Language
brew "tcl-tk"
# Simplified and community-driven man pages
brew "tldr"
# Vi 'workalike' with many additional features
brew "vim"
# Tools for the WireGuard secure network tunnel
brew "wireguard-tools"
# Download YouTube videos from the command-line
brew "youtube-dl"
# General-purpose lossless data-compression library
brew "zlib"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
